In [76]:
import pandas as pd
import numpy as np
from numpy.random import randn

**DataFrame**

In [79]:
my_data = randn(4,3) #Rows, Columns
my_rows = ["A", "B", "C", "D"]
my_column = ["Monday", "Tuesday", "Friday"]

In [81]:
#Create DataFram df
my_df = pd.DataFrame(my_data, my_rows, my_column)
my_df

     Monday   Tuesday    Friday
A -0.100425 -1.594306  0.101361
B  1.462435  0.632948  0.992001
C -1.157267 -0.128000 -1.990255
D -1.606561  0.018201 -1.326506

In [83]:
#import csv file 
my_df2 = pd.read_csv('covid-19.csv')
my_df2

,Direction,Year,Date,Weekday,Country,Commodity,Transport_Mode,Measure,Value,Cumulative
0,Exports,2015,01/01/2015,Thursday,All,All,All,$,104000000,104000000
1,Exports,2015,02/01/2015,Friday,All,All,All,$,96000000,200000000
2,Exports,2015,03/01/2015,Saturday,All,All,All,$,61000000,262000000
3,Exports,2015,04/01/2015,Sunday,All,All,All,$,74000000,336000000
4,Exports,2015,05/01/2015,Monday,All,All,All,$,105000000,442000000
...,...,...,...,...,...,...,...,...,...,...
111433,Reimports,2021,11/12/2021,Saturday,All,All,All,$,0,165000000
111434,Reimports,2021,12/12/2021,Sunday,All,All,All,$,0,165000000
111435,Reimports,2021,13/12/2021,Monday,All,All,All,$,2000000,166000000
111436,Reimports,2021,14/12/2021,Tuesday,All,All,All,$,1000000,167000000
111437,Reimports,2021,15/12/2021,Wednesday,All,All,All,$,1000000,168000000

In [85]:
#Pull out rows
my_df2.loc[0]

Direction            Exports
Year                    2015
Date              01/01/2015
Weekday             Thursday
Country                  All
Commodity                All
Transport_Mode           All
Measure                    $
Value              104000000
Cumulative         104000000
Name: 0, dtype: object

In [87]:
my_df2.loc[[0, 5, 10]]

,Direction,Year,Date,Weekday,Country,Commodity,Transport_Mode,Measure,Value,Cumulative
0,Exports,2015,01/01/2015,Thursday,All,All,All,$,104000000,104000000
5,Exports,2015,06/01/2015,Tuesday,All,All,All,$,76000000,518000000
10,Exports,2015,11/01/2015,Sunday,All,All,All,$,111000000,986000000

In [89]:
#Grab first 5 rows
my_df2.head()

,Direction,Year,Date,Weekday,Country,Commodity,Transport_Mode,Measure,Value,Cumulative
0,Exports,2015,01/01/2015,Thursday,All,All,All,$,104000000,104000000
1,Exports,2015,02/01/2015,Friday,All,All,All,$,96000000,200000000
2,Exports,2015,03/01/2015,Saturday,All,All,All,$,61000000,262000000
3,Exports,2015,04/01/2015,Sunday,All,All,All,$,74000000,336000000
4,Exports,2015,05/01/2015,Monday,All,All,All,$,105000000,442000000

In [91]:
#Grab certain number of first rows
my_df2.head(9)

,Direction,Year,Date,Weekday,Country,Commodity,Transport_Mode,Measure,Value,Cumulative
0,Exports,2015,01/01/2015,Thursday,All,All,All,$,104000000,104000000
1,Exports,2015,02/01/2015,Friday,All,All,All,$,96000000,200000000
2,Exports,2015,03/01/2015,Saturday,All,All,All,$,61000000,262000000
3,Exports,2015,04/01/2015,Sunday,All,All,All,$,74000000,336000000
4,Exports,2015,05/01/2015,Monday,All,All,All,$,105000000,442000000
5,Exports,2015,06/01/2015,Tuesday,All,All,All,$,76000000,518000000
6,Exports,2015,07/01/2015,Wednesday,All,All,All,$,59000000,577000000
7,Exports,2015,08/01/2015,Thursday,All,All,All,$,111000000,688000000
8,Exports,2015,09/01/2015,Friday,All,All,All,$,98000000,786000000

In [93]:
#Grab last 5 rows
my_df2.tail()

,Direction,Year,Date,Weekday,Country,Commodity,Transport_Mode,Measure,Value,Cumulative
111433,Reimports,2021,11/12/2021,Saturday,All,All,All,$,0,165000000
111434,Reimports,2021,12/12/2021,Sunday,All,All,All,$,0,165000000
111435,Reimports,2021,13/12/2021,Monday,All,All,All,$,2000000,166000000
111436,Reimports,2021,14/12/2021,Tuesday,All,All,All,$,1000000,167000000
111437,Reimports,2021,15/12/2021,Wednesday,All,All,All,$,1000000,168000000

In [95]:
#Grab certain number of last rows
my_df2.tail(10)

,Direction,Year,Date,Weekday,Country,Commodity,Transport_Mode,Measure,Value,Cumulative
111428,Reimports,2021,06/12/2021,Monday,All,All,All,$,1000000,161000000
111429,Reimports,2021,07/12/2021,Tuesday,All,All,All,$,0,161000000
111430,Reimports,2021,08/12/2021,Wednesday,All,All,All,$,1000000,162000000
111431,Reimports,2021,09/12/2021,Thursday,All,All,All,$,0,163000000
111432,Reimports,2021,10/12/2021,Friday,All,All,All,$,2000000,165000000
111433,Reimports,2021,11/12/2021,Saturday,All,All,All,$,0,165000000
111434,Reimports,2021,12/12/2021,Sunday,All,All,All,$,0,165000000
111435,Reimports,2021,13/12/2021,Monday,All,All,All,$,2000000,166000000
111436,Reimports,2021,14/12/2021,Tuesday,All,All,All,$,1000000,167000000
111437,Reimports,2021,15/12/2021,Wednesday,All,All,All,$,1000000,168000000

In [97]:
#Get info about DataFrame
my_df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 111438 entries, 0 to 111437
Data columns (total 10 columns):
 #   Column          Non-Null Count   Dtype
---  ------          --------------   -----
 0   Direction       111438 non-null  object
 1   Year            111438 non-null  int64
 2   Date            111438 non-null  object
 3   Weekday         111438 non-null  object
 4   Country         111438 non-null  object
 5   Commodity       111438 non-null  object
 6   Transport_Mode  111438 non-null  object
 7   Measure         111438 non-null  object
 8   Value           111438 non-null  int64
 9   Cumulative      111438 non-null  int64
dtypes: int64(3), object(7)
memory usage: 8.5+ MB

In [99]:
#Get shape of row and column
my_df2.shape

(111438, 10)

In [101]:
my_df2.ndim

2

In [103]:
my_df2.dtypes

Direction         object
Year               int64
Date              object
Weekday           object
Country           object
Commodity         object
Transport_Mode    object
Measure           object
Value              int64
Cumulative         int64
dtype: object

In [105]:
my_df2.describe()

                Year         Value    Cumulative
count  111438.000000  1.114380e+05  1.114380e+05
mean     2017.982430  2.905750e+07  5.174254e+09
std         1.992352  5.267248e+07  9.765606e+09
min      2015.000000  0.000000e+00  0.000000e+00
25%      2016.000000  1.000000e+06  1.140000e+08
50%      2018.000000  8.000000e+06  1.420000e+09
75%      2020.000000  2.800000e+07  4.797000e+09
max      2021.000000  5.490000e+08  6.718000e+10

In [107]:
my_df2['Year'].describe()

count    111438.000000
mean       2017.982430
std           1.992352
min        2015.000000
25%        2016.000000
50%        2018.000000
75%        2020.000000
max        2021.000000
Name: Year, dtype: float64

In [109]:
my_df2['Country']

0         All
1         All
2         All
3         All
4         All
         ...
111433    All
111434    All
111435    All
111436    All
111437    All
Name: Country, Length: 111438, dtype: object

In [111]:
my_df2.Value

0         104000000
1          96000000
2          61000000
3          74000000
4         105000000
            ...
111433            0
111434            0
111435      2000000
111436      1000000
111437      1000000
Name: Value, Length: 111438, dtype: int64

In [113]:
my_df2.iloc[:, 2]

0         01/01/2015
1         02/01/2015
2         03/01/2015
3         04/01/2015
4         05/01/2015
             ...
111433    11/12/2021
111434    12/12/2021
111435    13/12/2021
111436    14/12/2021
111437    15/12/2021
Name: Date, Length: 111438, dtype: object

In [115]:
my_df3 = pd.read_csv('dog.csv')
my_df3

                    Breed              Color        DogName  OwnerZip
0                COCKAPOO              BROWN        CHARLEY     15236
1            GER SHEPHERD        BLACK/BROWN         TACODA     15238
2           BELG MALINOIS            BRINDLE           EICH     15238
3                   MIXED        BLACK/BROWN          ARROW     15104
4     AM PIT BULL TERRIER        WHITE/BROWN         OAKLEY     15139
...                   ...                ...            ...       ...
2665         GOLDENDOODLE              BROWN        WINSLOW     15044
2666    YORKSHIRE TERRIER        BLACK/BROWN  ROCKY KALAKOS     15220
2667              LAB MIX  WHITE/BLACK/BROWN          ELLIE     15220
2668         GOLDENDOODLE              WHITE       CLARENCE     15143
2669    SHETLAND SHEEPDOG              BLACK        GRIFFIN     15136

[2670 rows x 4 columns]

In [117]:
#Count Distinct Values - Descending
my_df3['Color'].value_counts()

Color
BLACK                   371
BROWN                   309
WHITE                   226
WHITE/BLACK             196
BLACK/BROWN             183
                       ...
BLACK/ORANGE/BRINDLE      1
BROWN/ORANGE              1
BROWN/FAWN                1
BLACK/BROWN/GREY          1
BROWN/LIVER               1
Name: count, Length: 72, dtype: int64

In [119]:
#Count Distinct Values - Ascending
my_df3['Color'].value_counts(ascending = True)

Color
BROWN/LIVER               1
BROWN/FAWN                1
BROWN/ORANGE              1
BLACK/ORANGE/BRINDLE      1
BLACK/BROWN/GREY          1
                       ...
BLACK/BROWN             183
WHITE/BLACK             196
WHITE                   226
BROWN                   309
BLACK                   371
Name: count, Length: 72, dtype: int64

In [121]:
#Dogs name wo NaN
my_df3['DogName'].value_counts()

DogName
LUCY       35
BELLA      30
BAILEY     29
BUDDY      29
DAISY      26
           ..
CHOOKIE     1
AMY         1
DEE DEE     1
KAYLIE      1
GRIFFIN     1
Name: count, Length: 1428, dtype: int64

In [123]:
#Dogs name with NaN
my_df3['DogName'].value_counts(dropna = False)

DogName
LUCY       35
BELLA      30
BAILEY     29
BUDDY      29
DAISY      26
           ..
RAMBO       1
CHOOKIE     1
AMY         1
DEE DEE     1
GRIFFIN     1
Name: count, Length: 1429, dtype: int64

In [125]:
#Get relative Frequency - Percentage 
my_df3['Color'].value_counts(normalize = True)

Color
BLACK                   0.139212
BROWN                   0.115947
WHITE                   0.084803
WHITE/BLACK             0.073546
BLACK/BROWN             0.068668
                          ...
BLACK/ORANGE/BRINDLE    0.000375
BROWN/ORANGE            0.000375
BROWN/FAWN              0.000375
BLACK/BROWN/GREY        0.000375
BROWN/LIVER             0.000375
Name: proportion, Length: 72, dtype: float64

In [127]:
#Get Specific Item count
my_df3['Color'].value_counts()['WHITE']

226

In [129]:
#Count Unique Values - Size
my_df3.groupby('Color').size()

Color
APRICOT              15
BEIGE                 5
BLACK               371
BLACK WITH WHITE     21
BLACK/BRINDLE         5
                   ...
WHITE/ORANGE          5
WHITE/RED            14
WHITE/TAN            50
WHITE/YELLOW          2
YELLOW               51
Length: 72, dtype: int64

In [131]:
#Count Unique Values - Count
my_df3.groupby('Color').count()

                  Breed  DogName  OwnerZip
Color
APRICOT              15       15        15
BEIGE                 5        5         5
BLACK               371      371       371
BLACK WITH WHITE     21       21        21
BLACK/BRINDLE         5        5         5
...                 ...      ...       ...
WHITE/ORANGE          5        5         5
WHITE/RED            14       14        14
WHITE/TAN            50       50        50
WHITE/YELLOW          2        2         2
YELLOW               51       51        51

[72 rows x 3 columns]

In [133]:
#Get a count of all columns across all columns 
my_df3.apply(pd.value_counts)

C:\Users\veray\AppData\Local\Temp\ipykernel_37248\3881490877.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  my_df3.apply(pd.value_counts)
C:\Users\veray\AppData\Local\Temp\ipykernel_37248\3881490877.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  my_df3.apply(pd.value_counts)
C:\Users\veray\AppData\Local\Temp\ipykernel_37248\3881490877.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  my_df3.apply(pd.value_counts)
C:\Users\veray\AppData\Local\Temp\ipykernel_37248\3881490877.py:2: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  my_df3.apply(pd.value_counts)

TypeError: '<' not supported between instances of 'int' and 'str'

In [135]:
my_df4 = pd.read_csv('dog_data_short.csv')
my_df4

                 Breed        Color  DogName  OwnerZip
0             COCKAPOO        BROWN  CHARLEY     15236
1         GER SHEPHERD  BLACK/BROWN   TACODA     15238
2        BELG MALINOIS      BRINDLE     EICH     15238
3                MIXED  BLACK/BROWN    ARROW     15104
4  AM PIT BULL TERRIER  WHITE/BROWN   OAKLEY     15139

In [137]:
#Add column From list
gender = ["Male", "Female", "Male", "Male", "Female"]
my_df4["Gender"] = gender
my_df4

                 Breed        Color  DogName  OwnerZip  Gender
0             COCKAPOO        BROWN  CHARLEY     15236    Male
1         GER SHEPHERD  BLACK/BROWN   TACODA     15238  Female
2        BELG MALINOIS      BRINDLE     EICH     15238    Male
3                MIXED  BLACK/BROWN    ARROW     15104    Male
4  AM PIT BULL TERRIER  WHITE/BROWN   OAKLEY     15139  Female

In [139]:
# Add Default Values
my_df4["Alive/Dead"] = [True] * len(my_df4)
my_df4

                 Breed        Color  DogName  OwnerZip  Gender  Alive/Dead
0             COCKAPOO        BROWN  CHARLEY     15236    Male        True
1         GER SHEPHERD  BLACK/BROWN   TACODA     15238  Female        True
2        BELG MALINOIS      BRINDLE     EICH     15238    Male        True
3                MIXED  BLACK/BROWN    ARROW     15104    Male        True
4  AM PIT BULL TERRIER  WHITE/BROWN   OAKLEY     15139  Female        True

In [141]:
# Add NaN Values
my_df4["Show Dog"] = [np.nan] * len(my_df4)
my_df4

,Breed,Color,DogName,OwnerZip,Gender,Alive/Dead,Show Dog
0,COCKAPOO,BROWN,CHARLEY,15236,Male,True,NaN
1,GER SHEPHERD,BLACK/BROWN,TACODA,15238,Female,True,NaN
2,BELG MALINOIS,BRINDLE,EICH,15238,Male,True,NaN
3,MIXED,BLACK/BROWN,ARROW,15104,Male,True,NaN
4,AM PIT BULL TERRIER,WHITE/BROWN,OAKLEY,15139,Female,True,NaN

In [143]:
# Add column with .insert() - Allows position 
my_df4.insert(1, "Adopted", [True] * len(my_df4), True) #True allows duplicates
my_df4

,Breed,Adopted,Color,DogName,OwnerZip,Gender,Alive/Dead,Show Dog
0,COCKAPOO,True,BROWN,CHARLEY,15236,Male,True,NaN
1,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,Female,True,NaN
2,BELG MALINOIS,True,BRINDLE,EICH,15238,Male,True,NaN
3,MIXED,True,BLACK/BROWN,ARROW,15104,Male,True,NaN
4,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,Female,True,NaN

In [145]:
# Add column with assign() - creates new df
my_df5 = my_df4.assign(Horse = [False] * len(my_df4))
my_df5

,Breed,Adopted,Color,DogName,OwnerZip,Gender,Alive/Dead,Show Dog,Horse
0,COCKAPOO,True,BROWN,CHARLEY,15236,Male,True,NaN,False
1,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,Female,True,NaN,False
2,BELG MALINOIS,True,BRINDLE,EICH,15238,Male,True,NaN,False
3,MIXED,True,BLACK/BROWN,ARROW,15104,Male,True,NaN,False
4,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,Female,True,NaN,False

In [147]:
my_df4

,Breed,Adopted,Color,DogName,OwnerZip,Gender,Alive/Dead,Show Dog
0,COCKAPOO,True,BROWN,CHARLEY,15236,Male,True,NaN
1,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,Female,True,NaN
2,BELG MALINOIS,True,BRINDLE,EICH,15238,Male,True,NaN
3,MIXED,True,BLACK/BROWN,ARROW,15104,Male,True,NaN
4,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,Female,True,NaN

In [149]:
# Remove Column
my_df4.drop("Gender", axis = 1, inplace = True)
my_df4

,Breed,Adopted,Color,DogName,OwnerZip,Alive/Dead,Show Dog
0,COCKAPOO,True,BROWN,CHARLEY,15236,True,NaN
1,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,True,NaN
2,BELG MALINOIS,True,BRINDLE,EICH,15238,True,NaN
3,MIXED,True,BLACK/BROWN,ARROW,15104,True,NaN
4,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,True,NaN

In [151]:
# Remove Row
my_df4.drop(3, axis = 0)

,Breed,Adopted,Color,DogName,OwnerZip,Alive/Dead,Show Dog
0,COCKAPOO,True,BROWN,CHARLEY,15236,True,NaN
1,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,True,NaN
2,BELG MALINOIS,True,BRINDLE,EICH,15238,True,NaN
4,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,True,NaN

In [153]:
# Grab Row Method 1 location 
my_df4.loc[2]

Breed         BELG MALINOIS
Adopted                True
Color               BRINDLE
DogName                EICH
OwnerZip              15238
Alive/Dead             True
Show Dog                NaN
Name: 2, dtype: object

In [155]:
# Grab Row Method 2 Index location 
my_df4.iloc[3]

Breed               MIXED
Adopted              True
Color         BLACK/BROWN
DogName             ARROW
OwnerZip            15104
Alive/Dead           True
Show Dog              NaN
Name: 3, dtype: object

In [157]:
#Specific Points (row and column)
my_df4.loc[1,"DogName"]

'TACODA'

In [159]:
#Subsets
my_df4.loc[[1,3,4], ["DogName", "Breed", "Color"]]

  DogName                Breed        Color
1  TACODA         GER SHEPHERD  BLACK/BROWN
3   ARROW                MIXED  BLACK/BROWN
4  OAKLEY  AM PIT BULL TERRIER  WHITE/BROWN

**Conditional Selection**

In [164]:
#Conditional Selection 
#> < = >= <= etc
#Return Booleans
my_df3 == 'BROWN'

      Breed  Color  DogName  OwnerZip
0     False   True    False     False
1     False  False    False     False
2     False  False    False     False
3     False  False    False     False
4     False  False    False     False
...     ...    ...      ...       ...
2665  False   True    False     False
2666  False  False    False     False
2667  False  False    False     False
2668  False  False    False     False
2669  False  False    False     False

[2670 rows x 4 columns]

In [166]:
#Return DataFrame with data
my_df3[my_df3 == 'BROWN']

     Breed  Color DogName  OwnerZip
0      NaN  BROWN     NaN       NaN
1      NaN    NaN     NaN       NaN
2      NaN    NaN     NaN       NaN
3      NaN    NaN     NaN       NaN
4      NaN    NaN     NaN       NaN
...    ...    ...     ...       ...
2665   NaN  BROWN     NaN       NaN
2666   NaN    NaN     NaN       NaN
2667   NaN    NaN     NaN       NaN
2668   NaN    NaN     NaN       NaN
2669   NaN    NaN     NaN       NaN

[2670 rows x 4 columns]

In [168]:
# Run them on a column
my_df3[my_df3 == 'BROWN']['Color']

0       BROWN
1         NaN
2         NaN
3         NaN
4         NaN
        ...
2665    BROWN
2666      NaN
2667      NaN
2668      NaN
2669      NaN
Name: Color, Length: 2670, dtype: object

In [172]:
# Return multiple columns 
my_df3[my_df3 == 'BROWN'][['Color', 'Breed']]

      Color Breed
0     BROWN   NaN
1       NaN   NaN
2       NaN   NaN
3       NaN   NaN
4       NaN   NaN
...     ...   ...
2665  BROWN   NaN
2666    NaN   NaN
2667    NaN   NaN
2668    NaN   NaN
2669    NaN   NaN

[2670 rows x 2 columns]

In [178]:
# Multiple Conditional AND
my_df3[(my_df3['Color'] == "BROWN") & (my_df3['Breed'] == "MIXED")]

      Breed  Color        DogName  OwnerZip
42    MIXED  BROWN         STELLA     15044
272   MIXED  BROWN           HANK     15220
371   MIXED  BROWN          TEDDY     15136
402   MIXED  BROWN      GEORGIOUS     15212
505   MIXED  BROWN        HERSHEY     15071
523   MIXED  BROWN  MINDY MAZUREK     15037
572   MIXED  BROWN          STEVE     15229
584   MIXED  BROWN           BEAR     15122
602   MIXED  BROWN          CHLOE     15106
818   MIXED  BROWN         PEANUT     15025
943   MIXED  BROWN        DEE DEE     15031
946   MIXED  BROWN           SAGE     15035
948   MIXED  BROWN          BELLA     15035
995   MIXED  BROWN         MISTER     15139
1006  MIXED  BROWN        VANESSA     15065
1042  MIXED  BROWN           JACK     15223
1123  MIXED  BROWN         BUDDIE     15122
1195  MIXED  BROWN         COOPER     15071
1204  MIXED  BROWN            POE     15044
1211  MIXED  BROWN          EPPEY     15218
1258  MIXED  BROWN           BLUE     15235
1322  MIXED  BROWN         PHOEBE     15025
1466  MIXED  BROWN          JAXIE     15229
1476  MIXED  BROWN          PIPPA     15122
1659  MIXED  BROWN         ISABEL     15044
1780  MIXED  BROWN         WILBUR     15202
1798  MIXED  BROWN           PINO     15139
1847  MIXED  BROWN         MICKEY     15227
2180  MIXED  BROWN           KONA     15102
2351  MIXED  BROWN          BELLA     15209
2393  MIXED  BROWN         PEANUT     15143
2403  MIXED  BROWN           TOBY     15237
2430  MIXED  BROWN           LUCY     15229
2441  MIXED  BROWN          CASEY     15120
2524  MIXED  BROWN         PEANUT     15227
2562  MIXED  BROWN           JEFF     15146
2581  MIXED  BROWN           BRAX     15143
2597  MIXED  BROWN         BAILEY     15065

In [180]:
len(my_df3[(my_df3['Color'] == "BROWN") & (my_df3['Breed'] == "MIXED")])

38

In [182]:
# Multiple Conditional OR
my_df3[(my_df3['Color'] == "BROWN") | (my_df3['Breed'] == "MIXED")]

                   Breed        Color           DogName  OwnerZip
0               COCKAPOO        BROWN           CHARLEY     15236
3                  MIXED  BLACK/BROWN             ARROW     15104
12      AM PITT BULL MIX        BROWN              KING     15235
15                 MIXED        WHITE             RUSTY     15120
25            BEAGLE MIX        BROWN  CHRISTINA "TINA"     15025
...                  ...          ...               ...       ...
2657        GER SHEPHERD        BROWN             SARAH     15239
2658               MIXED        WHITE              LUNA     15017
2660              PUGGLE        BROWN              MACY     15044
2663  LABRADOR RETRIEVER        BROWN              NINO     15102
2665        GOLDENDOODLE        BROWN           WINSLOW     15044

[506 rows x 4 columns]

In [184]:
len(my_df3[(my_df3['Color'] == "BROWN") | (my_df3['Breed'] == "MIXED")])

506

In [188]:
# Return Specific column
my_df3[(my_df3['Color'] == "BROWN") & (my_df3['Breed'] == "MIXED")]["DogName"]

42             STELLA
272              HANK
371             TEDDY
402         GEORGIOUS
505           HERSHEY
523     MINDY MAZUREK
572             STEVE
584              BEAR
602             CHLOE
818            PEANUT
943           DEE DEE
946              SAGE
948             BELLA
995            MISTER
1006          VANESSA
1042             JACK
1123           BUDDIE
1195           COOPER
1204              POE
1211            EPPEY
1258             BLUE
1322           PHOEBE
1466            JAXIE
1476            PIPPA
1659           ISABEL
1780           WILBUR
1798             PINO
1847           MICKEY
2180             KONA
2351            BELLA
2393           PEANUT
2403             TOBY
2430             LUCY
2441            CASEY
2524           PEANUT
2562             JEFF
2581             BRAX
2597           BAILEY
Name: DogName, dtype: object

**Reset index**

In [225]:
# Create new Column
my_df4["Frame Header"] = ["Dog1", "Dog2", "Dog3", "Dog4", "Dog5"]
my_df4

,Breed,Adopted,Color,DogName,OwnerZip,Alive/Dead,Show Dog,Frame Header
0,COCKAPOO,True,BROWN,CHARLEY,15236,True,NaN,Dog1
1,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,True,NaN,Dog2
2,BELG MALINOIS,True,BRINDLE,EICH,15238,True,NaN,Dog3
3,MIXED,True,BLACK/BROWN,ARROW,15104,True,NaN,Dog4
4,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,True,NaN,Dog5

In [227]:
# Set Index
my_df4.set_index("Frame Header", inplace = True)

In [229]:
my_df4

,Breed,Adopted,Color,DogName,OwnerZip,Alive/Dead,Show Dog
Frame Header,,,,,,,
Dog1,COCKAPOO,True,BROWN,CHARLEY,15236,True,NaN
Dog2,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,True,NaN
Dog3,BELG MALINOIS,True,BRINDLE,EICH,15238,True,NaN
Dog4,MIXED,True,BLACK/BROWN,ARROW,15104,True,NaN
Dog5,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,True,NaN

In [231]:
# Reset index
my_df4.reset_index(inplace = True)

In [233]:
my_df4

,Frame Header,Breed,Adopted,Color,DogName,OwnerZip,Alive/Dead,Show Dog
0,Dog1,COCKAPOO,True,BROWN,CHARLEY,15236,True,NaN
1,Dog2,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,True,NaN
2,Dog3,BELG MALINOIS,True,BRINDLE,EICH,15238,True,NaN
3,Dog4,MIXED,True,BLACK/BROWN,ARROW,15104,True,NaN
4,Dog5,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,True,NaN

In [235]:
my_df4

,Frame Header,Breed,Adopted,Color,DogName,OwnerZip,Alive/Dead,Show Dog
0,Dog1,COCKAPOO,True,BROWN,CHARLEY,15236,True,NaN
1,Dog2,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,True,NaN
2,Dog3,BELG MALINOIS,True,BRINDLE,EICH,15238,True,NaN
3,Dog4,MIXED,True,BLACK/BROWN,ARROW,15104,True,NaN
4,Dog5,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,True,NaN

In [244]:
my_df4.drop("Frame Header", axis = 1, inplace = True)

In [246]:
my_df4

,Breed,Adopted,Color,DogName,OwnerZip,Alive/Dead,Show Dog
0,COCKAPOO,True,BROWN,CHARLEY,15236,True,NaN
1,GER SHEPHERD,True,BLACK/BROWN,TACODA,15238,True,NaN
2,BELG MALINOIS,True,BRINDLE,EICH,15238,True,NaN
3,MIXED,True,BLACK/BROWN,ARROW,15104,True,NaN
4,AM PIT BULL TERRIER,True,WHITE/BROWN,OAKLEY,15139,True,NaN